burgrp/py32-svd/svd/py32f002a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP2</name>
      <description>Comparator</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010210</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>CSR register lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOCK</name>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Comparator CSR bits are read-write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Comparator CSR bits are read-only</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALUE</name>
              <description>Comparator output status</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VALUER</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Comparator output is low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Comparator output is high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRMODE</name>
              <description>Comparator power mode
							selector</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PWRMODE</name>
                <enumeratedValue>
                  <name>HighSpeed</name>
                  <description>High speed / full power</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MediumSpeed</name>
                  <description>Medium speed / medium power</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowSpeed</name>
                  <description>Low speed / low power</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VeryLowSpeed</name>
                  <description>Very-low speed / ultra-low power</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Comparator polarity
							selector</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>POLARITY</name>
                <enumeratedValue>
                  <name>NotInverted</name>
                  <description>Output is not inverted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inverted</name>
                  <description>Output is inverted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WINMODE</name>
              <description>Comparator non-inverting input
							selector for window mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>WINMODE</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>COMP2 non-inverting input is not connected to COMP1_INP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>COMP2 non-inverting input is connected to COMP1_INP</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPSEL</name>
              <description>Comparator signal selector for
							non-inverting input</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>INPSEL</name>
                <enumeratedValue>
                  <name>PB4</name>
                  <description>PB4 connected to non-inverting input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB6</name>
                  <description>PB6 connected to non-inverting input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA3</name>
                  <description>PA3 connected to non-inverting input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PF3</name>
                  <description>PF3 connected to non-inverting input</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INMSEL</name>
              <description>Comparator signal selector for
							inverting input INM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>INMSEL</name>
                <enumeratedValue>
                  <name>OneQuarterVRef</name>
                  <description>1/4 of VRefint</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThreeQuarterVRef</name>
                  <description>3/4 of VRefint</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OneHalfVRef</name>
                  <description>1/2 of VRefint</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VRef</name>
                  <description>VRefint</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Vcc</name>
                  <description>VCC</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TS</name>
                  <description>TS</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB3</name>
                  <description>PB3 connected to inverting input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PB7</name>
                  <description>PB6 connected to inverting input</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PA2</name>
                  <description>PA2 connected to inverting input</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>COMP enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Comparator 1 disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Comparator 1 enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <displayName>FR</displayName>
          <description>Comparator Filter
					register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLTCNT</name>
              <description>Comparator filter and counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FLTEN</name>
              <description>Filter enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FLTEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Comparator digital filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Comparator digital filter enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
