burgrp/py32-svd/svd/py32f002a.svd
        <register>
          <name>CSR</name>
          <displayName>CSR</displayName>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OBLRSTF</name>
              <description>Option byte loader reset
							flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OBLRSTFR</name>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NoReset</name>
                  <description>No reset has occured</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>A reset has occured</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>Independent window watchdog reset
							flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Software reset flag</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>PWRRSTF</name>
              <description>BOR or POR/PDR flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>Pin reset flag</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>RMVF</name>
              <description>Remove reset flags</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RMVFW</name>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Clear</name>
                  <description>Clears the reset flag</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSI oscillator ready</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LSIRDY</name>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>Oscillator not ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>Oscillator ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSION</name>
              <description>LSI oscillator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LSION</name>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Oscillator OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>Oscillator ON</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>General-purpose I/Os</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x50000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <displayName>MODER</displayName>
          <description>GPIO port mode register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xEBFFFFFF</resetValue>
          <fields>
            <field>
              <name>MODE0</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MODE0</name>
                <enumeratedValue>
                  <name>Input</name>
                  <description>Input mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output</name>
                  <description>General purpose output mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Alternate</name>
                  <description>Alternate function mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Analog</name>
                  <description>Analog mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE15</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE14</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE13</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE12</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE11</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE10</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE9</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE8</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE7</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE6</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE5</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE4</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE3</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE2</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
            <field>
              <name>MODE1</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="MODE0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <displayName>OTYPER</displayName>
          <description>GPIO port output type register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OT0</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OT0</name>
                <enumeratedValue>
                  <name>PushPull</name>
                  <description>Output push-pull (reset state)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OpenDrain</name>
                  <description>Output open-drain</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OT15</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT14</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT13</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT12</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT11</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT10</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT9</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT8</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT7</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT6</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT5</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT4</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT3</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT2</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
            <field>
              <name>OT1</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OT0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <displayName>OSPEEDR</displayName>
          <description>GPIO port output speed
					register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0C000000</resetValue>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OSPEED0</name>
                <enumeratedValue>
                  <name>LowSpeed</name>
                  <description>Low speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MediumSpeed</name>
                  <description>Medium speed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HighSpeed</name>
                  <description>High speed</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VeryHighSpeed</name>
                  <description>Very high speed</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSPEED15</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED14</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED13</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED12</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>Port x configuration bits (y =
							0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues derivedFrom="OSPEED0"/>
            </field>
          </fields>
        </register>
