burgrp/py32-svd/svd/py32f002a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>System configuration controller</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <displayName>CFGR1</displayName>
          <description>SYSCFG configuration register
						1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>I2C_PA2_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>I2C_PA2_ANF</name>
                <enumeratedValue>
                  <name>Standard</name>
                  <description>Pin operate in standard mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogFilter</name>
                  <description>I2C Analog filter enabled on pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C_PF1_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PF1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PF0_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PF0</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PB8_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PB8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PB7_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PB7</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PB6_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PB6</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PA12_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA12</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PA11_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA11</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PA10_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA10</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PA9_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA9</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PA8_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA8</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PA7_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA7</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>I2C_PA3_ANF</name>
              <description>Analog filter enable control driving capability
								activation bits PA3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="I2C_PA2_ANF"/>
            </field>
            <field>
              <name>MEM_MODE</name>
              <description>Memory mapping selection
								bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MEM_MODE</name>
                <enumeratedValue>
                  <name>MainFlash</name>
                  <description>Main Flash memory mapped at 0x0000_0000</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SystemFlash</name>
                  <description>System Flash memory mapped at 0x0000_0000</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MainFlash2</name>
                  <description>Main Flash memory mapped at 0x0000_0000</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRAM</name>
                  <description>Embedded SRAM mapped at 0x0000_0000</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <displayName>CFGR2</displayName>
          <description>SYSCFG configuration register
						2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ETR_SRC_TIM1</name>
              <description>TIM1 ETR source selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ETR_SRC_TIM1</name>
                <enumeratedValue>
                  <name>GPIO</name>
                  <description>TIM1_ETR is connected to GPIO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1</name>
                  <description>TIM1_ETR is connected to COMP1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP2</name>
                  <description>TIM1_ETR is connected to COMP2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC</name>
                  <description>TIM1_ETR is connected to ADC</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>Cortex-M0+ LOCKUP bit enable
								bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LOCKUP_LOCK</name>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>Cortex-M0+ LOCKUP output disconnected from TIM1/16/17 Break input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>Cortex-M0+ LOCKUP output connected to TIM1/16/17 Break input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1_BRK_TIM1</name>
              <description>COMP1 output connect to TIM1 Break input</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>COMP1_BRK_TIM1</name>
                <enumeratedValue>
                  <name>Disconnected</name>
                  <description>COMP? output not connect to TIM? Break input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Connected</name>
                  <description>COMP? output connected to TIM? Break input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP2_BRK_TIM1</name>
              <description>COMP2 output connect to TIM1 Break input</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP1_BRK_TIM16</name>
              <description>COMP1 output connect to TIM16 Break input</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
            <field>
              <name>COMP2_BRK_TIM16</name>
              <description>COMP2 output connect to TIM16 Break input</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="COMP1_BRK_TIM1"/>
            </field>
          </fields>
        </register>
