burgrp/py32-svd/svd/py32f002a.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <description>Debug support</description>
      <groupName>DBGMCU</groupName>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>MCU Device ID Code Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CODE</name>
              <description>DBG ID code register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <displayName>CR</displayName>
          <description>Debug MCU Configuration
          Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_STOP</name>
              <description>Debug Stop Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DBG_STOP</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Debug Stop Mode Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Debug Stop Mode Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <displayName>APB_FZ1</displayName>
          <description>APB Freeze Register1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_IWDG_STOP</name>
              <description>Debug Independent Wachdog stopped when
              Core is halted</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DBG_IWDG_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>The independent watchdog counter clock continues even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>The independent watchdog counter clock is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_LPTIM_STOP</name>
              <description>Debug LPTIM stopped when Core is
              halted</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DBG_LPTIM_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>LPTIMx counter clock is fed even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>LPTIMx counter clock is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <displayName>APB_FZ2</displayName>
          <description>APB Freeze Register2</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DBG_TIMER1_STOP</name>
              <description>Debug Timer 1 stopped when Core is
              halted</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DBG_TIMER1_STOP</name>
                <enumeratedValue>
                  <name>Continue</name>
                  <description>The counter clock of TIMx is fed even if the core is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Stop</name>
                  <description>The counter clock of TIMx is stopped when the core is halted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBG_TIMER16_STOP</name>
              <description>Debug Timer 16 stopped when Core is
              halted</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="DBG_TIMER1_STOP"/>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00030000</resetValue>
          <fields>
            <field>
              <name>BIAS_CR</name>
              <description>MR Bias current</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>BIAS_CR_SEL</name>
              <description>MR Bias current selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BIAS_CR_SEL</name>
                <enumeratedValue>
                  <name>FactoryConfig</name>
                  <description>Bias config from factory config bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BiasCR</name>
                  <description>Bias config from BIAS_CR register</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable backup domain write protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DBP</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Access to RTC, RTC Backup and RCC CSR registers disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Access to RTC, RTC Backup and RCC CSR registers enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VOS</name>
              <description>Voltage scaling range selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>VOS</name>
                <enumeratedValue>
                  <name>V1_2</name>
                  <description>1.2 V (range 1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1_0</name>
                  <description>1.0 V (range 2)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRRDY_TIME</name>
              <description>Time selection wakeup from LP to VR</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MRRDY_TIME</name>
                <enumeratedValue>
                  <name>TwoMicroSec</name>
                  <description>MR ready after 2 us</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThreeMicroSec</name>
                  <description>MR ready after 3 us</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FourMicroSec</name>
                  <description>MR ready after 4 us</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FiveMicroSec</name>
                  <description>MR ready after 5 us</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLS_SLPTIME</name>
              <description>Flash wait time after wakeup from the stop mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FLS_SLPTIME</name>
                <enumeratedValue>
                  <name>FiveMicroSec</name>
                  <description>Flash wait 5 us after wakeup from stop mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TwoMicroSec</name>
                  <description>Flash wait 2 us after wakeup from stop mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ThreeMicroSec</name>
                  <description>Flash wait 3 us after wakeup from stop mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExcuteFromSRAM</name>
                  <description>Excute program from SRAM after wakeup from stop mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPRUN</name>
              <description>Low-power run</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LPRUN</name>
                <enumeratedValue>
                  <name>MainMode</name>
                  <description>Voltage regulator in Main mode in Low-power run mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LowPowerMode</name>
                  <description>Voltage regulator in low-power mode in Low-power run mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAM_RETV</name>
              <description>SRAM retention voltage control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SRAM_RETV</name>
                <enumeratedValue>
                  <name>V0_9</name>
                  <description>Supply voltage 0.9 V for SRAM</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V1_x</name>
                  <description>Supply voltage 1.0 or 1.2 V (depends on VOS) for SRAM</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <description>HSI open time control</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>HSION_CTRL</name>
                <enumeratedValue>
                  <name>WaiteMR</name>
                  <description>Enable HSI after MR is stable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WakeOnVR</name>
                  <description>Enable HSI when VR is on (enable HSI immediately when wakeup)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000500</resetValue>
        </register>
        <register>
          <name>SR</name>
          <description>Power status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>